docs/index.org
#+title: Meyvn
#+SUBTITLE: Know your build
#+OPTIONS: toc:1 num:nil
#+HTML_HEAD: <link rel="stylesheet" href="css/et-book.css" type="text/css" media="screen" />
#+HTML_HEAD: <link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro:300,300i,400,600&display=swap" rel="stylesheet">
#+HTML_HEAD: <link rel="stylesheet" href="css/main.css" type="text/css" media="screen" />
#+HTML_HEAD: <link rel="stylesheet" href="css/post.css" type="text/css" media="screen" />
#+HTML_HEAD:  <script type="text/javascript" src="js/navigation.js"></script>

* Intro 

#+BEGIN_QUOTE
You Know Nothing, Jon Snow. — Ygritte
#+END_QUOTE

The word maven comes from the Yiddish meyvn, meaning one who understands. You can think of Meyvn as: 

- A build tool
- A wrapper for Maven
- A ~tools.deps~ extension.

Meyvn generates uberjars (executables) and jars (libraries), and deploys them on remote servers, Clojars, etc.

Meyvn is also an integrated development environment that builds upon the nREPL ecosystem and Emacs (there is an Emacs Lisp client).

Finally, Meyvn offers fully fleshed quick-start templates covering general Clojure development, web development, etc.

* Goals

- Use ~deps.edn~ as single source of truth. 

- One command to do it all: compile, package, install on a remote server, etc.

- Standalone and lightweight. It only depends on Clojure and Maven (with no external dependencies).

- Ability to selectively shrink uberjars

- Leverage the Maven ecosystem

- Include a good Clojurescript story: official compiler, shared aot cache, all options available to user, etc.

- Sustainable open source with dual licensing scheme.

Read [[https://danielsz.github.io/2020-09-01T1556.html][more]].

* Installation
Meyvn requires Maven. Interestingly, Meyvn does not require Clojure. Neither a Clojure installation nor the official CLI tools. This is because Meyvn relies on Maven for pulling core dependencies (it's turtles all the way down). If you do have Clojure installed, you can install Meyvn with our easy installer. Otherwise, please follow the manual installation instructions.

** Easy installation

Copy and paste the following command in your terminal:

#+begin_src sh
clj -Sdeps '{:deps {org.meyvn/meyvn-installer {:mvn/version "1.5.5"}}}' -M -m meyvn-installer.core
#+end_src

** Manual installation
   
- Download Meyvn to your local repository

#+begin_src shell
mvn org.apache.maven.plugins:maven-dependency-plugin:3.6.1:get -Dartifact=org.meyvn:meyvn:1.8.0
#+end_src

- Create a new shell script in your path.

#+BEGIN_SRC sh
$ touch /usr/local/bin/myvn
#+END_SRC

- Edit your newly created shell script with the following.

#+BEGIN_SRC sh
$ cat /usr/local/bin/myvn
#!/bin/sh
java -Dmaven.home=/usr/share/maven -jar ~/.m2/repository/org/meyvn/meyvn/1.8.0/meyvn-1.8.0.jar "$@"
#+END_SRC

~maven.home~ is a Java property that points to Maven's home, ie. the root of your Maven installation. Find out Maven's home by typing ~mvn --version~ in the terminal.

/Note:/ Maven can run without this environment variable on the command line, but the Maven Invoker APIs require it to be set explicitly.

* Usage

The standard Maven lifecycle phases and goals are passed as arguments. There’s [[https://maven.apache.org/guides/][documentation]], too. 

For example: 

#+BEGIN_SRC 
myvn compile 
#+END_SRC 

Or 

#+BEGIN_SRC 
myvn package
#+END_SRC 

Or 

#+BEGIN_SRC 
myvn deploy
#+END_SRC 

You can also chain publishing goals, just like in Maven:

#+BEGIN_SRC sh
myvn clean clojure:test install
#+END_SRC

* Debugging the build

If you see errors with the build, run ~myvn -x pom~. This will persist Meyvn’s pom file. You can now run ~mvn~ on it and debug as you normally would in Maven. 

#+BEGIN_SRC sh
mvn <goal>
#+END_SRC

* Configuration

Configuration is stored in ~meyvn.edn~, which will be created in the root of your project on first run with default settings. Aside from the ~:pom~ key which captures the project coordinates and is always used, the other keys can be enabled or disabled as needed. 

