docs/index.org
* How does it work?

~tools.deps~ has the ability to translate a ~deps.edn~ file into a pom file (~clj -Spom~). Meyvn starts off from that pom file and augments it with features that make sense for Clojure workflows. Meyvn’s pom file is transient and does not interfere with POM files that may already be present in your project. 

| POM                         | lein pom | clj -Spom | myvn -x pom |
|-----------------------------+----------+-----------+-------------|
| root                        | ☑        | ☑         | ☑           |
| modelVersion                | ☑        | ☑         | ☑           |
| groupId                     | ☑        | ☑         | ☑           |
| artifactId                  | ☑        | ☑         | ☑           |
| version                     | ☑        | ☑         | ☑           |
| dependencies                | ☑        | ☑         | ☑           |
| compilation (clj)           | ☒        | ☒         | ☑           |
| compilation (cljs)          | ☒        | ☒         | ☑           |
| uberjars                    | ☒        | ☒         | ☑           |
| native image (graalvm)      | ☒        | ☒         | ☑           |
| obfuscation (proguard)      | ☒        | ☒         | ☑           |
| javafx (plugin)             | ☒        | ☒         | ☑           |
| gpg signing (plugin)        | ☒        | ☒         | ☑           |
| deploying (plugin)          | ☒        | ☒         | ☑           |
| build plan (plugin)         | ☒        | ☒         | ☑           |
| minification (css + images) | ☒        | ☒         | ☑           |
| data reader support         | ☒        | ☒         | ☑           |
| jpro (plugin)               | ☒        | ☒         | ☑           |
| jpackage (plugin)           | ☒        | ☒         | ☑           |
| appimage (plugin)           | ☒        | ☒         | ☑           |


Maven is invoked via an API (~Apache Maven Invoker~) and can be passed all lifecycle phases or goal it supports. 

Clojurescript sources are compiled and included in the final artifact. Clojurescript compilation is done in its own process with the official compiler.

** Uberjars

Consider the following deps.edn file: 

#+BEGIN_SRC clojure
{:paths ["src/clj"]
 :deps {org.clojure/core.async {:mvn/version "0.4.474"}
        ring {:mvn/version "1.6.3"}
        compojure {:mvn/version "1.6.1"}}
 :aliases {:cljs {:extra-deps {org.clojure/clojurescript {:mvn/version "1.10.238"}
                               reagent {:mvn/version "0.8.1"} 
                               secretary {:mvn/version "1.2.3"}}
                  :extra-paths ["src/cljs"]}}}
#+END_SRC

The Clojurescript-side of the mixed project is cleanly segregated. The ~:cljs~ alias is used when compiling the ~*.cljs~ files, but not when assembling the uberjar, helping to keep the latter small. You tell Meyvn to use this alias in the ~meyvn.edn~ configuration, under the ~cljs~ -> ~tools-deps-alias~ keys.

If there is a ~resources~ folder in the base directory, it will be included in the build.

Meyvn uses the Apache Maven Shade Plugin in order to build uberjars.

#+BEGIN_QUOTE
Shading dependencies is the process of including and renaming dependencies (thus relocating the classes & rewriting affected bytecode & resources) to create a private copy that you bundle alongside your own code. But the shading part is actually optional: the plugin allows to include dependencies in your jar (fat jar), and optionally rename (shade) dependencies.
#+END_QUOTE

Meyvn gives you access to the exclusions facility provided by the Shade plugin, equivalent to Leiningen’s [[https://github.com/technomancy/leiningen/blob/cee9029d15719058d39b4ccc30de2e0975f07f8a/sample.project.clj#L418][uberjar-exclusions]] or Boot’s 
[[https://github.com/boot-clj/boot/blob/e6ea562af765ee2b50703ab33a00cf615d0bef43/boot/pod/src/boot/pod.clj#L627][standard-jar-exclusions]].

#+BEGIN_SRC clojure
:excludes {:artifacts ["org.clojure:google-closure-library"]
           :filters ["META-INF/*.MF" "META-INF/*.SF" "META-INF/*.DSA" "META-INF/*.RSA"]}
#+END_SRC

Note that you don’t need to exclude ~INDEX/LIST~ as this is [[https://github.com/intelie/maven-shade-plugin/blob/71b5895028f9c9ca2730b45d1117d8e6d3372a3e/src/main/java/org/apache/maven/plugins/shade/DefaultShader.java#L137][built-in]] by the Shade plugin.

Additionally, Meyvn allows you to exclude artifacts. For example, sometimes the Closure library is pulled by a transitive dependency and lands in your final uberjar. With Meyvn you can prevent that.  

Data readers are merged with a [[https://github.com/danielsz/shade-edn-transformer][custom transformer]] that knows how to merge EDN maps. 

