docs/index.html
<div id="outline-container-org2829e5b" class="outline-2">
<h2 id="org2829e5b">How does it work?</h2>
<div class="outline-text-2" id="text-org2829e5b">
<p>
<code>tools.deps</code> has the ability to translate a <code>deps.edn</code> file into a pom file (<code>clj -Spom</code>). Meyvn starts off from that pom file and augments it with features that make sense for Clojure workflows. Meyvn’s pom file is transient and does not interfere with POM files that may already be present in your project. 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">POM</th>
<th scope="col" class="org-left">lein pom</th>
<th scope="col" class="org-left">clj -Spom</th>
<th scope="col" class="org-left">myvn -x pom</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">root</td>
<td class="org-left">☑</td>
<td class="org-left">☑</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">modelVersion</td>
<td class="org-left">☑</td>
<td class="org-left">☑</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">groupId</td>
<td class="org-left">☑</td>
<td class="org-left">☑</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">artifactId</td>
<td class="org-left">☑</td>
<td class="org-left">☑</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">version</td>
<td class="org-left">☑</td>
<td class="org-left">☑</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">dependencies</td>
<td class="org-left">☑</td>
<td class="org-left">☑</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">compilation (clj)</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">compilation (cljs)</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">uberjars</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">native image (graalvm)</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">obfuscation (proguard)</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">javafx (plugin)</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">gpg signing (plugin)</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">deploying (plugin)</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">build plan (plugin)</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">minification (css + images)</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">data reader support</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">jpro (plugin)</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">jpackage (plugin)</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>

<tr>
<td class="org-left">appimage (plugin)</td>
<td class="org-left">☒</td>
<td class="org-left">☒</td>
<td class="org-left">☑</td>
</tr>
</tbody>
</table>


<p>
Maven is invoked via an API (<code>Apache Maven Invoker</code>) and can be passed all lifecycle phases or goal it supports. 
</p>

<p>
Clojurescript sources are compiled and included in the final artifact. Clojurescript compilation is done in its own process with the official compiler.
</p>
</div>
<div id="outline-container-org4b60eff" class="outline-3">
<h3 id="org4b60eff">Uberjars</h3>
<div class="outline-text-3" id="text-org4b60eff">
<p>
Consider the following deps.edn file: 
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">{</span><span style="color: #008b8b;">:paths</span> <span style="color: #7388d6;">[</span><span style="color: #8b2252;">"src/clj"</span><span style="color: #7388d6;">]</span>
 <span style="color: #008b8b;">:deps</span> <span style="color: #7388d6;">{</span><span style="color: #228b22;">org.clojure</span>/core.async <span style="color: #909183;">{</span><span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"0.4.474"</span><span style="color: #909183;">}</span>
        ring <span style="color: #909183;">{</span><span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"1.6.3"</span><span style="color: #909183;">}</span>
        compojure <span style="color: #909183;">{</span><span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"1.6.1"</span><span style="color: #909183;">}</span><span style="color: #7388d6;">}</span>
 <span style="color: #008b8b;">:aliases</span> <span style="color: #7388d6;">{</span><span style="color: #008b8b;">:cljs</span> <span style="color: #909183;">{</span><span style="color: #008b8b;">:extra-deps</span> <span style="color: #709870;">{</span><span style="color: #228b22;">org.clojure</span>/clojurescript <span style="color: #907373;">{</span><span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"1.10.238"</span><span style="color: #907373;">}</span>
                               reagent <span style="color: #907373;">{</span><span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"0.8.1"</span><span style="color: #907373;">}</span> 
                               secretary <span style="color: #907373;">{</span><span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"1.2.3"</span><span style="color: #907373;">}</span><span style="color: #709870;">}</span>
                  <span style="color: #008b8b;">:extra-paths</span> <span style="color: #709870;">[</span><span style="color: #8b2252;">"src/cljs"</span><span style="color: #709870;">]</span><span style="color: #909183;">}</span><span style="color: #7388d6;">}</span><span style="color: #707183;">}</span>
</pre>
</div>

<p>
The Clojurescript-side of the mixed project is cleanly segregated. The <code>:cljs</code> alias is used when compiling the <code>*.cljs</code> files, but not when assembling the uberjar, helping to keep the latter small. You tell Meyvn to use this alias in the <code>meyvn.edn</code> configuration, under the <code>cljs</code> -&gt; <code>tools-deps-alias</code> keys.
</p>

<p>
If there is a <code>resources</code> folder in the base directory, it will be included in the build.
</p>

<p>
Meyvn uses the Apache Maven Shade Plugin in order to build uberjars.
</p>

<blockquote>
<p>
Shading dependencies is the process of including and renaming dependencies (thus relocating the classes &amp; rewriting affected bytecode &amp; resources) to create a private copy that you bundle alongside your own code. But the shading part is actually optional: the plugin allows to include dependencies in your jar (fat jar), and optionally rename (shade) dependencies.
</p>
</blockquote>

<p>
Meyvn gives you access to the exclusions facility provided by the Shade plugin, equivalent to Leiningen’s <a href="https://github.com/technomancy/leiningen/blob/cee9029d15719058d39b4ccc30de2e0975f07f8a/sample.project.clj#L418">uberjar-exclusions</a> or Boot’s 
<a href="https://github.com/boot-clj/boot/blob/e6ea562af765ee2b50703ab33a00cf615d0bef43/boot/pod/src/boot/pod.clj#L627">standard-jar-exclusions</a>.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #008b8b;">:excludes</span> <span style="color: #707183;">{</span><span style="color: #008b8b;">:artifacts</span> <span style="color: #7388d6;">[</span><span style="color: #8b2252;">"org.clojure:google-closure-library"</span><span style="color: #7388d6;">]</span>
           <span style="color: #008b8b;">:filters</span> <span style="color: #7388d6;">[</span><span style="color: #8b2252;">"META-INF/*.MF"</span> <span style="color: #8b2252;">"META-INF/*.SF"</span> <span style="color: #8b2252;">"META-INF/*.DSA"</span> <span style="color: #8b2252;">"META-INF/*.RSA"</span><span style="color: #7388d6;">]</span><span style="color: #707183;">}</span>
</pre>
</div>

<p>
Note that you don’t need to exclude <code>INDEX/LIST</code> as this is <a href="https://github.com/intelie/maven-shade-plugin/blob/71b5895028f9c9ca2730b45d1117d8e6d3372a3e/src/main/java/org/apache/maven/plugins/shade/DefaultShader.java#L137">built-in</a> by the Shade plugin.
</p>

<p>
Additionally, Meyvn allows you to exclude artifacts. For example, sometimes the Closure library is pulled by a transitive dependency and lands in your final uberjar. With Meyvn you can prevent that.  
</p>

<p>
Data readers are merged with a <a href="https://github.com/danielsz/shade-edn-transformer">custom transformer</a> that knows how to merge EDN maps. 
</p>
</div>
</div>
