docs/index.org
** Regular jars

Libraries uploaded to Clojars are typically non-aot, source-only jars. Uploading to Clojars follows [[https://github.com/clojars/clojars-web/wiki/Pushing#maven][standard procedure]]. 
Private repositories are supported as well. For example, to upload an artifact to ~deps.co~, adjust the remote repository setting in the jar section of ~meyvn.edn~. 

#+BEGIN_SRC clojure
:distribution-management {:id "deps"
                          :url "https://repo.deps.co/your-org/releases"
#+END_SRC

In all cases, use ~settings.xml~ for storing your credentials, or refer to Maven for [[http://maven.apache.org/guides/mini/guide-encryption.html][password encryption]].

** Pom files

Meyvn works with its own set of pom files. It isn’t bothered with existing pom files in your project directory. This is by design. The single source of truth is ~deps.edn~. Together with the configuration (in ~meyvn.edn~), it knows all that it needs to know.

The added benefit is that you can continue to maintain a pom file if you are already using a Maven workflow. 

** Dependency mechanism

The transitive dependency mechanism used by Maven is guided by the nearest wins conflict resolution strategy.
This allows for resolution of individual conflicts: for any particular conflicting dependency, you can specify its version within your own POM, and that version becomes the nearest.

#+BEGIN_QUOTE
Note that if two dependency versions are at the same depth in the dependency tree, until Maven 2.0.8 it was not defined which one would win, but since Maven 2.0.9 it's the order in the declaration that counts: the first declaration wins.
#+END_QUOTE

You can use [[https://maven.apache.org/enforcer/enforcer-rules/dependencyConvergence.html][dependency convergence]], forcing the build to fail on transitive dependencies that are not on the same version. 

** Testing
Consider the following ~deps.edn~ file.

#+BEGIN_SRC clojure
{:paths ["src"]
 :deps {
   clj-time {:mvn/version "0.14.2"}
 }
 :aliases {:test {:extra-paths ["test"]
                  :extra-deps {org.clojure/test.check {:mvn/version "0.9.0"}}}}}

#+END_SRC

Again, please note the best practice of segregating paths and dependencies with aliases.
To run your tests with ~Meyvn~, make sure the relevant section in ~meyvn.edn~ looks like this:

#+BEGIN_SRC clojure
:testing {:enabled true
          :tools-deps-alias :test}
#+END_SRC

Then run:

#+BEGIN_SRC sh
$ myvn clojure:test
#+END_SRC

The build will abort in case of errors. 
 

** Interactive coding

#+BEGIN_SRC sh
$ myvn -a nrepl
#+END_SRC

This will start a nREPL server with Cider middleware that you can connect to with nREPL clients.

** Profiles

In Maven, profiles are used to parameterize builds, not the runtime environment of the executable. There are good reasons for this, but this means that after your build is done, you can't just run the executable (if it needs environment variables to be set). First you need to make sure the environment is set up properly. 

Meyvn can help with that. When you enable the ~profiles~ section, Meyvn will create a Maven profile in the transient POM, and under each profile (for example, staging or production), it will write a standard ~edn~ map describing your environment into standard java properties.

(We leverage the fact that custom properties can be defined under any profile.)

On your staging/production server, those properties will be accessible in the ~pom~ alongside your jar in the local repository.

Meyvn doesn't want to force you to install clojure or Meyvn on your servers, but if you do, you can use it to list those properties and pipe into a script in typical UNIX style.  

#+BEGIN_SRC sh
$ myvn -x list -a org.bar:foo:1.0.0 -p production
#+END_SRC

The ~-a~ switch is for artifact (in Maven coordinates) and ~-p~ is for profile.

The script could, typically, massage the properties into environment variables. How you use them depends on your final command output, really. The last mile is context-dependent.

In the absence of Meyvn on the server, you can get the properties via the Maven helper plugin.

#+BEGIN_SRC sh
$ mvn org.apache.maven.plugins:maven-help-plugin:3.1.0:all-profiles "-Dartifact=org.company:myproject:1.0.0
#+END_SRC
#+BEGIN_SRC sh
$ mvn org.apache.maven.plugins:maven-help-plugin:3.1.0:evaluate -Dexpression=project.properties -Dartifact=org.company:myproject:1.0.0
#+END_SRC

Finally, Meyvn has built-in support for [[http://smarden.org/runit/index.html][~runit~]], the UNIX init scheme with service supervision. The following command will write the environment in the format expected by ~runit~ under the path specified by the ~-t~ argument.

#+BEGIN_SRC sh
myvn -x write -a org.bar:foo:1.0.0  -p production -t /opt/foo
#+END_SRC sh

** Auxiliary commands

Meyvn runs with the same interface as Maven. Goals and lifecycle phases are being passed to it as you would with standard Maven.
The -x flag changes the mode of operation and allows you to run specialized tasks.

Simply run ~myvn -x~ to see what is available. Currently, Meyvn can generate the POM file, list newer versions of dependencies, show platform information. More functionality is to be expected. 

* Will it work?

It should work for the typical Clojure workflows. Please feel free to contact me in private if you want help solving your company’s build workflow.

Please note that Windows is not supported (the Clojure command line tools are not available).

Feel free to open issues regarding the supported workflows. New workflows will be added under commercial agreements.

* Roadmap 

The takeaway for Meyvn is that building on top of the Maven ecosystem is rewarding. It is a huge ecosystem, well documented and extremely mature. A lot of functionality just sits there, waiting to be tapped by our tooling (in areas such as continuous integration, generated documentation, testing, reporting, etc.)

The plan is to have more features as companies sponsor them. Those features will be fed back to the OSS version. 
 
