docs/index.html
<div id="outline-container-org4be61fd" class="outline-3">
<h3 id="org4be61fd">Regular jars</h3>
<div class="outline-text-3" id="text-org4be61fd">
<p>
Libraries uploaded to Clojars are typically non-aot, source-only jars. Uploading to Clojars follows <a href="https://github.com/clojars/clojars-web/wiki/Pushing#maven">standard procedure</a>. 
Private repositories are supported as well. For example, to upload an artifact to <code>deps.co</code>, adjust the remote repository setting in the jar section of <code>meyvn.edn</code>. 
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #008b8b;">:distribution-management</span> <span style="color: #707183;">{</span><span style="color: #008b8b;">:id</span> <span style="color: #8b2252;">"deps"</span>
                          <span style="color: #008b8b;">:url</span> <span style="color: #8b2252;">"https://repo.deps.co/your-org/releases"</span>
</pre>
</div>

<p>
In all cases, use <code>settings.xml</code> for storing your credentials, or refer to Maven for <a href="http://maven.apache.org/guides/mini/guide-encryption.html">password encryption</a>.
</p>
</div>
</div>
<div id="outline-container-org6818aae" class="outline-3">
<h3 id="org6818aae">Pom files</h3>
<div class="outline-text-3" id="text-org6818aae">
<p>
Meyvn works with its own set of pom files. It isn’t bothered with existing pom files in your project directory. This is by design. The single source of truth is <code>deps.edn</code>. Together with the configuration (in <code>meyvn.edn</code>), it knows all that it needs to know.
</p>

<p>
The added benefit is that you can continue to maintain a pom file if you are already using a Maven workflow. 
</p>
</div>
</div>
<div id="outline-container-org02e4533" class="outline-3">
<h3 id="org02e4533">Dependency mechanism</h3>
<div class="outline-text-3" id="text-org02e4533">
<p>
The transitive dependency mechanism used by Maven is guided by the nearest wins conflict resolution strategy.
This allows for resolution of individual conflicts: for any particular conflicting dependency, you can specify its version within your own POM, and that version becomes the nearest.
</p>

<blockquote>
<p>
Note that if two dependency versions are at the same depth in the dependency tree, until Maven 2.0.8 it was not defined which one would win, but since Maven 2.0.9 it's the order in the declaration that counts: the first declaration wins.
</p>
</blockquote>

<p>
You can use <a href="https://maven.apache.org/enforcer/enforcer-rules/dependencyConvergence.html">dependency convergence</a>, forcing the build to fail on transitive dependencies that are not on the same version. 
</p>
</div>
</div>
<div id="outline-container-orgacd3361" class="outline-3">
<h3 id="orgacd3361">Testing</h3>
<div class="outline-text-3" id="text-orgacd3361">
<p>
Consider the following <code>deps.edn</code> file.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">{</span><span style="color: #008b8b;">:paths</span> <span style="color: #7388d6;">[</span><span style="color: #8b2252;">"src"</span><span style="color: #7388d6;">]</span>
 <span style="color: #008b8b;">:deps</span> <span style="color: #7388d6;">{</span>
   clj-time <span style="color: #909183;">{</span><span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"0.14.2"</span><span style="color: #909183;">}</span>
 <span style="color: #7388d6;">}</span>
 <span style="color: #008b8b;">:aliases</span> <span style="color: #7388d6;">{</span><span style="color: #008b8b;">:test</span> <span style="color: #909183;">{</span><span style="color: #008b8b;">:extra-paths</span> <span style="color: #709870;">[</span><span style="color: #8b2252;">"test"</span><span style="color: #709870;">]</span>
                  <span style="color: #008b8b;">:extra-deps</span> <span style="color: #709870;">{</span><span style="color: #228b22;">org.clojure</span>/test.check <span style="color: #907373;">{</span><span style="color: #008b8b;">:</span><span style="color: #228b22;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #008b8b;">version</span> <span style="color: #8b2252;">"0.9.0"</span><span style="color: #907373;">}</span><span style="color: #709870;">}</span><span style="color: #909183;">}</span><span style="color: #7388d6;">}</span><span style="color: #707183;">}</span>

</pre>
</div>

<p>
Again, please note the best practice of segregating paths and dependencies with aliases.
To run your tests with <code>Meyvn</code>, make sure the relevant section in <code>meyvn.edn</code> looks like this:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #008b8b;">:testing</span> <span style="color: #707183;">{</span><span style="color: #008b8b;">:enabled</span> <span style="color: #008b8b;">true</span>
          <span style="color: #008b8b;">:tools-deps-alias</span> <span style="color: #008b8b;">:test</span><span style="color: #707183;">}</span>
</pre>
</div>

<p>
Then run:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ myvn clojure:test
</pre>
</div>

<p>
The build will abort in case of errors. 
</p>
</div>
</div>
<div id="outline-container-orga253310" class="outline-3">
<h3 id="orga253310">Interactive coding</h3>
<div class="outline-text-3" id="text-orga253310">
<div class="org-src-container">
<pre class="src src-sh">$ myvn -a nrepl
</pre>
</div>

<p>
This will start a nREPL server with Cider middleware that you can connect to with nREPL clients.
</p>
</div>
</div>
<div id="outline-container-org615c4e8" class="outline-3">
<h3 id="org615c4e8">Profiles</h3>
<div class="outline-text-3" id="text-org615c4e8">
<p>
In Maven, profiles are used to parameterize builds, not the runtime environment of the executable. There are good reasons for this, but this means that after your build is done, you can't just run the executable (if it needs environment variables to be set). First you need to make sure the environment is set up properly. 
</p>

<p>
Meyvn can help with that. When you enable the <code>profiles</code> section, Meyvn will create a Maven profile in the transient POM, and under each profile (for example, staging or production), it will write a standard <code>edn</code> map describing your environment into standard java properties.
</p>

<p>
(We leverage the fact that custom properties can be defined under any profile.)
</p>

<p>
On your staging/production server, those properties will be accessible in the <code>pom</code> alongside your jar in the local repository.
</p>

<p>
Meyvn doesn't want to force you to install clojure or Meyvn on your servers, but if you do, you can use it to list those properties and pipe into a script in typical UNIX style.  
</p>

<div class="org-src-container">
<pre class="src src-sh">$ myvn -x list -a org.bar:foo:1.0.0 -p production
</pre>
</div>

<p>
The <code>-a</code> switch is for artifact (in Maven coordinates) and <code>-p</code> is for profile.
</p>

<p>
The script could, typically, massage the properties into environment variables. How you use them depends on your final command output, really. The last mile is context-dependent.
</p>

<p>
In the absence of Meyvn on the server, you can get the properties via the Maven helper plugin.
</p>

<div class="org-src-container">
<pre class="src src-sh">$ mvn org.apache.maven.plugins:maven-help-plugin:3.1.0:all-profiles <span style="color: #8b2252;">"-Dartifact=org.company:myproject:1.0.0</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh">$ mvn org.apache.maven.plugins:maven-help-plugin:3.1.0:evaluate -Dexpression=project.properties -Dartifact=org.company:myproject:1.0.0
</pre>
</div>

<p>
Finally, Meyvn has built-in support for <a href="http://smarden.org/runit/index.html"><code>runit</code></a>, the UNIX init scheme with service supervision. The following command will write the environment in the format expected by <code>runit</code> under the path specified by the <code>-t</code> argument.
</p>

<p>
#+BEGIN<sub>SRC</sub> sh
myvn -x write -a org.bar:foo:1.0.0  -p production -t /opt/foo
#+END<sub>SRC</sub> sh
</p>
</div>
</div>
<div id="outline-container-orge073e8d" class="outline-3">
<h3 id="orge073e8d">Auxiliary commands</h3>
<div class="outline-text-3" id="text-orge073e8d">
<p>
Meyvn runs with the same interface as Maven. Goals and lifecycle phases are being passed to it as you would with standard Maven.
The -x flag changes the mode of operation and allows you to run specialized tasks.
</p>

<p>
Simply run <code>myvn -x</code> to see what is available. Currently, Meyvn can generate the POM file, list newer versions of dependencies, show platform information. More functionality is to be expected. 
</p>
</div>
</div>
</div>
<div id="outline-container-org373996f" class="outline-2">
<h2 id="org373996f">Will it work?</h2>
<div class="outline-text-2" id="text-org373996f">
<p>
It should work for the typical Clojure workflows. Please feel free to contact me in private if you want help solving your company’s build workflow.
</p>

<p>
Feel free to open issues regarding the supported workflows. New workflows will be added under commercial agreements.
</p>
</div>
</div>
<div id="outline-container-org6d20d7f" class="outline-2">
<h2 id="org6d20d7f">Roadmap</h2>
<div class="outline-text-2" id="text-org6d20d7f">
<p>
The takeaway for Meyvn is that building on top of the Maven ecosystem is rewarding. It is a huge ecosystem, well documented and extremely mature. A lot of functionality just sits there, waiting to be tapped by our tooling (in areas such as continuous integration, generated documentation, testing, reporting, etc.)
</p>

<p>
The plan is to have more features as companies sponsor them. Those features will be fed back to the OSS version. 
</p>
</div>
</div>
