docs/index.html
<div id="outline-container-orgd764a4d" class="outline-2">
<h2 id="orgd764a4d">What about Boot and Leiningen?</h2>
<div class="outline-text-2" id="text-orgd764a4d">
<p>
Boot and Leiningen can also produce artifacts, and they also provide development-time workflows and extension mechanisms. They are fine, too. In other words, there is no competition, only complementary options.
</p>
</div>
</div>
<div id="outline-container-org2028475" class="outline-2">
<h2 id="org2028475">Sustainable open source</h2>
<div class="outline-text-2" id="text-org2028475">
<p>
We as a community know how to write open source software, but we are less knowledgeable in how to make that activity sustainable. With Meyvn, I’m attempting to lead a sustainable Open Source project. That means that Meyvn is dual licensed, with a commercial license available for sale.
</p>

<p>
The LGPLv3 licensed community version will always remain free and available to all parties. However, companies who use Meyvn in their operations are expected to acquire a commercial license. 
</p>

<p>
At this stage, I am interested in users who can relate with the mission statement, for whom finding ways to do sustainable OSS is a shared value and not mere lip service.
</p>
</div>
</div>
<div id="outline-container-orgff5e806" class="outline-2">
<h2 id="orgff5e806">License</h2>
<div class="outline-text-2" id="text-orgff5e806">
<p>
Meyvn is released under a dual licensing scheme. 
</p>

<p>
Meyvn is an Open Source project licensed under the terms of the LGPLv3
license.  Please see <a href="http://www.gnu.org/licenses/lgpl-3.0.html">http://www.gnu.org/licenses/lgpl-3.0.html</a> for
license text.
</p>

<p>
Meyvn Enterprise has a commercial-friendly license allowing private
forks and modifications of Meyvn. Licensees get a build of Meyvn with
commercial features. Additionally, licensees get access to email support.
</p>

<p>
Please contact me for more details.
</p>
</div>
</div>
<div id="outline-container-org2566e45" class="outline-2">
<h2 id="org2566e45">Patron</h2>
<div class="outline-text-2" id="text-org2566e45">
<p>
Writing and maintaining Open Source Software takes time and effort. Be a mensch. Be a maven. <a href="https://www.patreon.com/danielsz">Patronize</a> Meyvn.
</p>
</div>
</div>
<div id="outline-container-org8b490db" class="outline-2">
<h2 id="org8b490db">Literature</h2>
<div class="outline-text-2" id="text-org8b490db">
<ul class="org-ul">
<li><a href="http://nealford.com/memeagora/2013/01/22/why_everyone_eventually_hates_maven.html">Why Everyone (Eventually) Hates (or Leaves) Maven</a></li>
<li><a href="https://rule1.quora.com/Use-Maven-Not-Gradle">Use Maven, Not Gradle</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Szmulewicz</p>
<p class="date">Created: 2024-07-24 Wed 19:18</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
